RedditClone/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if params[:post_id]   #If nested route
        @comment.post_id = params[:post_id]
    else
        @comment.post_id = Comment.find(params[:comment][:parent_id]).post_id
    end

    @comment.user_id = current_user.id
    if  @comment.save!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "dddd"], ["user_id", 2], ["post_id", 1], ["created_at", "2019-07-09 21:26:24.212293"], ["updated_at", "2019-07-09 21:26:24.212293"]]