RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id =  current_user.id
    debugger
    @post.sub_ids = [1]
    if @post.save
---
INSERT INTO "post_subs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 1], ["post_id", 2], ["created_at", "2019-07-09 20:06:28.399390"], ["updated_at", "2019-07-09 20:06:28.399390"]]
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "First Post"], ["url", ""], ["content", "Great Post"], ["user_id", 2], ["created_at", "2019-07-09 20:06:28.371275"], ["updated_at", "2019-07-09 20:06:28.371275"]]