RedditClone/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-07-09 17:52:07.379636"], ["session_token", "u5ir5PiZ-uDeukCrzPzBdQ"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.update!(session_token: self.session_token)